uhnp/src/InformationRegisters/РегистрСостоянийОбъектов/РегистрСостоянийОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрСостоянийОбъектов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СостояниеОбъекта</name>
    <type>
      <types>EnumRef.СостоянияИнцидентов</types>
      <types>EnumRef.СостоянияСогласования</types>
      <types>EnumRef.СтатусыВыгружаемыхОбъектовЕИС</types>
      <types>EnumRef.СостоянияДоговоров</types>
      <types>EnumRef.СостоянияТранзакций</types>
      <types>EnumRef.СостоянияМероприятий</types>
      <types>EnumRef.СостоянияПроектов</types>
      <types>CatalogRef.СостоянияСогласования</types>
      <types>EnumRef.СостоянияОтчетов</types>
      <types>EnumRef.СтатусыЛотов</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектыДляСогласования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/СостоянияСогласования/СостоянияСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияСогласования</name>
  <enumValues>
    <name>Отклонено</name>
  </enumValues>
  <enumValues>
    <name>Рассматривается</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>НаУтверждении</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Возвращена</name>
  </enumValues>
  <enumValues>
    <name>УдалитьНаОплате</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОплачено</name>
  </enumValues>
  <enumValues>
    <name>УдалитьНеактивен</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СостоянияОтчетов/СостоянияОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОтчетов</name>
  <enumValues>
    <name>Запланирован</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>Возвращен</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>ЗаписанСОшибкой</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СостоянияПроцесса/СостоянияПроцесса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияПроцесса</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Приостановлен</name>
  </enumValues>
  <enumValues>
    <name>Остановлен</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/ЗаявкаНаИзменениеНСИ/ЗаявкаНаИзменениеНСИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаИзменениеНСИ</name>
  <posting>Deny</posting>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийИзмененияНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменяемыйОбъект</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласующий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбразцовыйОбъект</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаКонсолидации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочникБД</name>
    <type>
      <types>CatalogRef.СправочникиБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДочерняяБаза</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИзменениеРеквизитов</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсходноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НовоеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИзменениеТЧ</name>
    <attributes>
      <name>ТабличнаяЧасть</name>
      <type>
        <types>CatalogRef.ТабличныеЧастиБД</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсходноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НовоеЗначение</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИзменениеДополнительныхРеквизитов</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходноеЗначение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходнаяТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НовоеЗначение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>НоваяТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИзменениеДополнительныхСведений</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходноеЗначение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>НовоеЗначение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаявкиНаИзменениеСвязанныхОбъектов</name>
    <attributes>
      <name>ЗаявкаНаСвязанныйОбъект</name>
      <type>
        <types>DocumentRef.ЗаявкаНаИзменениеНСИ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Catalogs/СостоянияСогласования/СостоянияСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СостоянияСогласования</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НаУтверждении</name>
      <description>На утверждении</description>
    </items>
    <items>
      <name>Отклонено</name>
      <description>Отклонено</description>
    </items>
    <items>
      <name>Утверждено</name>
      <description>Утверждено</description>
    </items>
    <items>
      <name>Черновик</name>
      <description>Черновик</description>
    </items>
  </predefined>
  <attributes>
    <name>СоответствиеСостояниюЭтапаПроцесса</name>
    <type>
      <types>EnumRef.СостоянияЭтаповУниверсальныхПроцессов</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/CommonModules/ДействияСогласованиеУХСервер/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль хранит универсальные команды работы с согласованием в контексте 
// серверного кода.
////////////////////////////////////////////////////////////////////////////////

Функция ВернутьЦФОПоОбъекту(Ссылка) Экспорт
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ЦФО",Ссылка.Метаданные()) Тогда
		
		ОрганизацияОтбор=Ссылка.ЦФО;
		
	ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация",Ссылка.Метаданные()) Тогда
		
		ОрганизацияОтбор=Ссылка.Организация;
		
	Иначе
		
		ОрганизацияОтбор=Справочники.Организации.ПустаяСсылка();
		
	КонецЕсли;
	
	Возврат ОрганизацияОтбор;
		
КонецФункции // ВернутьЦФОПоОбъекту()

Функция ВозможноПроведениеОбъекта(Ссылка) Экспорт
	РезультатФункции = Ложь;
	Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Ссылка)) Тогда 
		РезультатФункции = Ложь;
	Иначе	
		РазрешеноПроведениеВМетаданных = Ссылка.Метаданные().Проведение;
		РезультатФункции = РазрешеноПроведениеВМетаданных <> Метаданные.СвойстваОбъектов.Проведение.Запретить;
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		 // ВозможноПроведениеОбъекта() 

Процедура УстановитьТекущегоОтветственного(Форма) Экспорт
	
	Форма.Согласующий =  УправлениеОтчетамиУХ.ПолучитьОтветственногоЗаТипОбъекта(Форма.Объект.Ссылка, ВернутьЦФОПоОбъекту(Форма.Объект.Ссылка));
	
КонецПроцедуры

Процедура УстановитьДоступностьЭлементов(Форма, Доступность, ТипСсылки = Неопределено) Экспорт
	
	ЭтоЭкземплярОтчета = (ТипСсылки = Тип("ДокументСсылка.НастраиваемыйОтчет"));
	
	Для Каждого Элемент ИЗ Форма.Элементы Цикл
		
		Если ЭтоЭкземплярОтчета И (Элемент.Имя = "СостояниеЗаявки") Тогда 
			Продолжить;				// у экземпляра отчета изменение согласования доступно всегда.
		ИначеЕсли ТипЗнч(Элемент) = Тип("ПолеФормы") Тогда
			 Элемент.ТолькоПросмотр = НЕ Доступность;
		КонецЕсли;
				
	КонецЦикла;
		
КонецПроцедуры

// Определяет доступность элементов согласования формы, в зависимости 
// от статуса согласования.
Процедура ОпределитьСостояниеЗаявки(Форма, ОбновитьОтветственныхВход = Ложь) Экспорт

	// Функция - заглушка для совместимости с предыдущими версиями
	МодульУправленияПроцессамиУХ.ОпределитьСостояние(Форма, ОбновитьОтветственныхВход);
	
КонецПроцедуры

Процедура ОпределитьСостояние(Форма) Экспорт

	Если Форма=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма.СостояниеЗаявки = УправлениеПроцессамиСогласованияУХ.ВернутьТекущееСостояние(Форма.Объект.Ссылка);
	Форма.Элементы.СостояниеЗаявки.СписокВыбора.Очистить();
	Форма.Элементы.СостояниеЗаявки.СписокВыбора.Добавить(Форма.СостояниеЗаявки);
	
	Форма.Элементы.ОтменитьСогласование.Доступность = Ложь;
		
	Форма.Элементы.Группа_ОбработкаМаршрутаСогласования.ТекущаяСтраница = ?(ЗначениеЗаполнено(Форма.СостояниеЗаявки), Форма.Элементы.НетМаршрутаСогласованияВОбработке, Форма.Элементы.НетМаршрутаСогласования);
		
	Если ЗначениеЗаполнено(Форма.СостояниеЗаявки) Тогда
		
		Если Форма.СостояниеЗаявки = Перечисления.СостоянияСогласования.Отклонена Тогда
			
			Форма.Элементы.СостояниеЗаявки.СписокВыбора.Добавить(Перечисления.СостоянияСогласования.НаУтверждении);
			УстановитьДоступностьЭлементов(Форма,Истина);
			
		ИначеЕсли Форма.СостояниеЗаявки = Перечисления.СостоянияСогласования.НаУтверждении Тогда
			
			ЕстьСуперПользователь = МодульСогласованияДокументовУХ.ЕстьСуперПользователь(ВернутьЦФОПоОбъекту(Форма.Объект.Ссылка));
			
			Если НЕ ЕстьСуперПользователь Тогда
				УстановитьДоступностьЭлементов(Форма,Ложь);
			КонецЕсли;
			
			Форма.Элементы.СнятьСОбработки.Доступность = ЕстьСуперПользователь;
			
			Если ПользовательИмеетПравоУтверждатьЗаявку(Форма) Тогда
				Форма.Элементы.СостояниеЗаявки.СписокВыбора.Добавить(Перечисления.СостоянияСогласования.Утверждена);
				Форма.Элементы.СостояниеЗаявки.СписокВыбора.Добавить(Перечисления.СостоянияСогласования.Отклонена);
			КонецЕсли;
				
		ИначеЕсли Форма.СостояниеЗаявки = Перечисления.СостоянияСогласования.Утверждена Тогда
			
			ЕстьСуперПользователь = МодульСогласованияДокументовУХ.ЕстьСуперПользователь(ВернутьЦФОПоОбъекту(Форма.Объект.Ссылка));
			
			Если НЕ ЕстьСуперПользователь Тогда
				УстановитьДоступностьЭлементов(Форма,Ложь);
			КонецЕсли;
			
			Форма.Элементы.СнятьСОбработки.Доступность      = ЕстьСуперПользователь;
			Если ПользовательИмеетПравоУтверждатьЗаявку(Форма) Тогда
				Форма.Элементы.СостояниеЗаявки.СписокВыбора.Добавить(Перечисления.СостоянияСогласования.НаУтверждении);
				Форма.Элементы.СостояниеЗаявки.СписокВыбора.Добавить(Перечисления.СостоянияСогласования.Отклонена);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПользовательИмеетПравоУтверждатьЗаявку(Форма) Экспорт
	
	Возврат НЕ ЗначениеЗаполнено(Форма.Согласующий) ИЛИ (ТипЗнч(Форма.Согласующий) = Тип("СправочникСсылка.Пользователи") И Форма.Согласующий = ОбщегоНазначенияУХ.ПолучитьЗначениеПеременной("глТекущийПользователь"));
	
КонецФункции
	
Функция СуществуетРабочаяЗаявка(Ссылка,ВидОперации=Неопределено) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаявкаНаИзменениеНСИ.Ссылка КАК Ссылка,
	|	ЗаявкаНаИзменениеНСИ.ИзменяемыйОбъект КАК ИзменяемыйОбъект,
	|	РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта КАК СостояниеОбъекта
	|ПОМЕСТИТЬ УтвержденныеЗаявки
	|ИЗ
	|	Документ.ЗаявкаНаИзменениеНСИ КАК ЗаявкаНаИзменениеНСИ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрСостоянийОбъектов.СрезПоследних КАК РегистрСостоянийОбъектовСрезПоследних
	|		ПО ЗаявкаНаИзменениеНСИ.Ссылка = РегистрСостоянийОбъектовСрезПоследних.Объект
	|ГДЕ
	|	ЗаявкаНаИзменениеНСИ.ИзменяемыйОбъект = &Ссылка
	|	И ЗаявкаНаИзменениеНСИ.ПометкаУдаления = ЛОЖЬ
	|	И ЗаявкаНаИзменениеНСИ.ВидОперации = &ВидОперации
	|	И РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта = &СостояниеУтвержден
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаявкаНаИзменениеНСИ.Ссылка КАК Ссылка,
	|	ЗаявкаНаИзменениеНСИ.ИзменяемыйОбъект КАК ИзменяемыйОбъект
	|ПОМЕСТИТЬ СуществующиеЗаявки
	|ИЗ
	|	Документ.ЗаявкаНаИзменениеНСИ КАК ЗаявкаНаИзменениеНСИ
	|ГДЕ
	|	ЗаявкаНаИзменениеНСИ.ИзменяемыйОбъект = &Ссылка
	|	И ЗаявкаНаИзменениеНСИ.ПометкаУдаления = ЛОЖЬ
	|	И ЗаявкаНаИзменениеНСИ.ВидОперации = &ВидОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СуществующиеЗаявки.Ссылка КАК Ссылка
	|ИЗ
	|	СуществующиеЗаявки КАК СуществующиеЗаявки
	|ГДЕ
	|	НЕ СуществующиеЗаявки.Ссылка В
	|				(ВЫБРАТЬ
	|					УтвержденныеЗаявки.Ссылка
	|				ИЗ
	|					УтвержденныеЗаявки)";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("СостояниеУтвержден", Перечисления.СостоянияСогласования.Утверждена); 
	
	Если ВидОперации=Неопределено Тогда
		
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"ЗаявкаНаИзменениеНСИ.ВидОперации = &ВидОперации", "ИСТИНА");
		
	Иначе
		
		Запрос.УстановитьПараметр("ВидОперации",ВидОперации);
		
	КонецЕсли;
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		
		Возврат Результат.Ссылка;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
			
КонецФункции	

Функция ПолучитьСостояниеСогласования_Черновик(ТипОбъектаСогласования)

	Если ТипОбъектаСогласования = Тип("ДокументСсылка.НастраиваемыйОтчет") Тогда
		Возврат Перечисления.СостоянияОтчетов.Выполняется;
	ИначеЕсли ЭтоЗаявкаНаОперацию(ТипОбъектаСогласования) Тогда
		Возврат Перечисления.СостоянияСогласования.Черновик;
	Иначе
		Возврат Справочники.СостоянияСогласования.Черновик;
	КонецЕсли;

КонецФункции

Функция ПолучитьСостояниеСогласования_НаУтверждении(ТипОбъектаСогласования)

	Если ТипОбъектаСогласования = Тип("ДокументСсылка.НастраиваемыйОтчет") Тогда
		Возврат Перечисления.СостоянияОтчетов.Подготовлен;
	ИначеЕсли ЭтоЗаявкаНаОперацию(ТипОбъектаСогласования) Тогда
		Возврат Перечисления.СостоянияСогласования.НаУтверждении;
	Иначе
		Возврат Справочники.СостоянияСогласования.НаУтверждении;
	КонецЕсли;

КонецФункции

Функция ПолучитьСостояниеСогласования_Отклонен(ТипОбъектаСогласования)

	Если ТипОбъектаСогласования = Тип("ДокументСсылка.НастраиваемыйОтчет") Тогда
		Возврат Перечисления.СостоянияОтчетов.Возвращен;
	ИначеЕсли ЭтоЗаявкаНаОперацию(ТипОбъектаСогласования) Тогда
		Возврат Перечисления.СостоянияСогласования.Отклонена;
	Иначе
		Возврат Справочники.СостоянияСогласования.Отклонено;
	КонецЕсли;

КонецФункции

Функция ПолучитьСостояниеСогласования_Утвержден(ТипОбъектаСогласования) Экспорт

	Если ТипОбъектаСогласования = Тип("ДокументСсылка.НастраиваемыйОтчет") Тогда
		Возврат Перечисления.СостоянияОтчетов.Утвержден;
	ИначеЕсли ЭтоЗаявкаНаОперацию(ТипОбъектаСогласования) Тогда
		Возврат Перечисления.СостоянияСогласования.Утверждена;
	Иначе
		СсылкаНаОбъектБД = ОбщегоНазначенияСерверУХ.ВернутьСсылкуБдПоТипу(ТипОбъектаСогласования);
		Если ЗначениеЗаполнено(СсылкаНаОбъектБД) Тогда
			Возврат СсылкаНаОбъектБД.ЗначениеРеквизитаСостоянияУтвержден;
		Иначе	
			Возврат Справочники.СостоянияСогласования.Утверждено;
		КонецЕсли;
	КонецЕсли;

КонецФункции

Процедура ОпределитьСостояниеОбъекта(Форма) Экспорт

	Если Форма = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРеквизитаСостояние = "СостояниеЗаявки";
	ДоступныеСостояния = Новый Массив;
	
	Реквизиты = Форма.ПолучитьРеквизиты();	
	
	ЕстьРеквизитыСогласования = 0;
	
	Для Каждого Рек Из Реквизиты Цикл 
		
		Если Рек.Имя = "Согласующий" Тогда
			ЕстьРеквизитыСогласования = ЕстьРеквизитыСогласования + 1;
		КонецЕсли;
		Если Рек.Имя = ИмяРеквизитаСостояние Тогда
			ЕстьРеквизитыСогласования = ЕстьРеквизитыСогласования + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьРеквизитыСогласования <> 2 Тогда
		Возврат;
	КонецЕсли;
	
	Элементы 		= Форма.Элементы;
	ОбъектСсылка 	= Форма.Объект.Ссылка;
	ТипСсылки 		= ТипЗнч(ОбъектСсылка);
	
	Если ЗначениеЗаполнено(Форма[ИмяРеквизитаСостояние]) Тогда
		СостояниеЗаявки = Форма[ИмяРеквизитаСостояние];
	Иначе
		СостояниеЗаявки = УправлениеПроцессамиСогласованияУХ.ВернутьТекущееСостояние(ОбъектСсылка);
	КонецЕсли;	
	
	ДоступныеСостояния.Добавить(СостояниеЗаявки);
	
	Если Не ЗначениеЗаполнено(Форма.Согласующий) Тогда
		УстановитьТекущегоОтветственного(Форма);		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СостояниеЗаявки) И НЕ СостояниеЗаявки = Перечисления.СостоянияПроцесса.Черновик Тогда		
		Элементы.Группа_ОбработкаМаршрутаСогласования.ТекущаяСтраница = Элементы.МаршрутСогласованияЗапущен;
	Иначе	
	    Элементы.Группа_ОбработкаМаршрутаСогласования.ТекущаяСтраница = Элементы.МаршрутСогласованияНеЗапущен;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СостояниеЗаявки) ИЛИ ДоступныеСостояния.Количество() = 0 Тогда
		СостояниеЗаявки = ПолучитьСостояниеСогласования_Черновик(ТипСсылки);
	Иначе
		//Элементы.СостояниеЗаявки.Видимость = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СостояниеЗаявки) Тогда
		
		Если СостояниеЗаявки = ПолучитьСостояниеСогласования_Отклонен(ТипСсылки) Тогда
			
			ДоступныеСостояния.Добавить(ПолучитьСостояниеСогласования_НаУтверждении(ТипСсылки));			
			Элементы.Группа_ОбработкаМаршрутаСогласования.ТекущаяСтраница = Элементы.МаршрутСогласованияНеЗапущен;
				
		ИначеЕсли СостояниеЗаявки = ПолучитьСостояниеСогласования_НаУтверждении(ТипСсылки) Тогда
			
			ЕстьСуперПользователь = МодульСогласованияДокументовУХ.ЕстьСуперПользователь(ВернутьЦФОПоОбъекту(Форма.Объект.Ссылка));
	
			Элементы.ОтменитьСогласование.Доступность = ЕстьСуперПользователь;
						
			Если НЕ ЕстьСуперПользователь Тогда
				УстановитьДоступностьЭлементов(Форма, Ложь, ТипСсылки);
			КонецЕсли;
										
		ИначеЕсли СостояниеЗаявки = ПолучитьСостояниеСогласования_Утвержден(ТипСсылки) Тогда
			
			ЕстьСуперПользователь = МодульСогласованияДокументовУХ.ЕстьСуперПользователь(ВернутьЦФОПоОбъекту(Форма.Объект.Ссылка));
			
			Если НЕ ЕстьСуперПользователь Тогда
				УстановитьДоступностьЭлементов(Форма, Ложь, ТипСсылки);
			КонецЕсли;
			
			Элементы.ОтменитьСогласование.Доступность = ЕстьСуперПользователь;
			Элементы.СогласоватьДокумент.Доступность = Ложь;
			
		Иначе
			
			ЕстьСуперПользователь = МодульСогласованияДокументовУХ.ЕстьСуперПользователь(ВернутьЦФОПоОбъекту(Форма.Объект.Ссылка));
			
			Элементы.ОтменитьСогласование.Доступность = ЕстьСуперПользователь;
			Элементы.СогласоватьДокумент.Доступность = Истина;
						
		КонецЕсли;
		
	КонецЕсли;
	
	Форма[ИмяРеквизитаСостояние] = СостояниеЗаявки;
		
КонецПроцедуры

// Возвращает массив ссылок на непроведенных документы из массива выделенных строк СтрокиСогласованияВход.
Функция ВернутьМассивНепроведенныхДокументовВыделенныхСтрок(СтрокиСогласованияВход) Экспорт
	РезультатФункции = Новый Массив;
	Для Каждого ТекСтрокиСогласованияВход Из СтрокиСогласованияВход Цикл
		Если ВозможноПроведениеОбъекта(ТекСтрокиСогласованияВход) Тогда
			Если НЕ ТекСтрокиСогласованияВход.Проведен Тогда
				РезультатФункции.Добавить(ТекСтрокиСогласованияВход);
			Иначе
				// Пропускаем.
			КонецЕсли;
		Иначе
			// Пропускаем.
		КонецЕсли;
	КонецЦикла;	
	Возврат РезультатФункции;
КонецФункции		// ВернутьМассивНепроведенныхДокументовВыделенныхСтрок()

// Добавляет в МассивРезультат имя реквизита колонки таблицы
Процедура НайтиПодчиненныйЭлементТаблицы(КоллекцияЭлементовФормы, МассивРезультат, ИмяТабличнойЧасти, ИмяРеквизита)
	
	Для Каждого ПодчиненныйЭлементТаблицы Из КоллекцияЭлементовФормы Цикл
		
		Если ТипЗнч(ПодчиненныйЭлементТаблицы) = Тип("ГруппаФормы") Тогда
			НайтиПодчиненныйЭлементТаблицы(ПодчиненныйЭлементТаблицы.ПодчиненныеЭлементы, МассивРезультат, ИмяТабличнойЧасти, ИмяРеквизита);
		ИначеЕсли ТипЗнч(ПодчиненныйЭлементТаблицы) = Тип("ПолеФормы") Тогда
			Если ПодчиненныйЭлементТаблицы.ПутьКДанным = "Объект." + ИмяТабличнойЧасти + "." + ИмяРеквизита Тогда
				МассивРезультат.Добавить(ПодчиненныйЭлементТаблицы.Имя);
			Иначе
				// Выполняем поиск далее.
			КонецЕсли;
		Иначе
			// Выполняем поиск далее.
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает массив имен реквизитов организации для формы согласуемого объекта ОбъектВход.
Функция ПолучитьМассивИменРеквизитаОрганизацииСогласования(Форма) Экспорт
	РезультатФункции = Новый Массив;
	Попытка
		// Получим реквизит разделения по организации для данного объекта ИБ.
		ОбъектФормы = Форма.Объект;
		СправочникМетаданного = МодульУправленияОповещениямиУХ.ПолучитьТипОбъектаОповещенияПоСсылке(ОбъектФормы.Ссылка);
		Если ЗначениеЗаполнено(СправочникМетаданного) Тогда
			РеквизитОрганизации = СправочникМетаданного.РеквизитРазделенияПоОрганизациям;
			// Проверим существование такого реквизита у объекта.
			Если ЗначениеЗаполнено(РеквизитОрганизации) Тогда
								
				ПозицияТочки = СтрНайти(РеквизитОрганизации, ".");
				Если ПозицияТочки > 0 Тогда
					ИмяТабличнойЧасти = Лев(РеквизитОрганизации, ПозицияТочки - 1);
					ИмяРеквизита = Сред(РеквизитОрганизации, ПозицияТочки + 1);
					
					Если ОбщегоназначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбъектФормы, ИмяТабличнойЧасти) Тогда
						Если ОбъектФормы[ИмяТабличнойЧасти].Количество() > 0 Тогда
							Если ОбщегоназначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбъектФормы[ИмяТабличнойЧасти][0], ИмяРеквизита) Тогда
								
								// Найдём элементы формы типа ПолеФормы, ссылающиеся на данный реквизит объекта.							
								Для Каждого ТекЭлементы Из Форма.Элементы Цикл
									
									Если ТипЗнч(ТекЭлементы) = Тип("ТаблицаФормы") Тогда
										Если ТекЭлементы.ПутьКДанным = "Объект." + ИмяТабличнойЧасти Тогда										
											НайтиПодчиненныйЭлементТаблицы(ТекЭлементы.ПодчиненныеЭлементы, РезультатФункции, ИмяТабличнойЧасти, ИмяРеквизита);	
										Иначе
											// Выполняем поиск далее.
										КонецЕсли;
									Иначе
										// Выполняем поиск далее.
									КонецЕсли;
									
								КонецЦикла;
								
							Иначе
								// Выполняем поиск далее.
							КонецЕсли;
						Иначе
							// Выполняем поиск далее.
						КонецЕсли;
					Иначе
						// Выполняем поиск далее.
					КонецЕсли;
					
				ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбъектФормы, РеквизитОрганизации) Тогда
					// Найдём элементы формы типа ПолеФормы, ссылающиеся на данный реквизит объекта.
					Для Каждого ТекЭлементы Из Форма.Элементы Цикл
						Если ТипЗнч(ТекЭлементы) = Тип("ПолеФормы") Тогда
							Если ТекЭлементы.ПутьКДанным = "Объект." + РеквизитОрганизации Тогда
								РезультатФункции.Добавить(ТекЭлементы.Имя); 
							Иначе
								// Выполняем поиск далее.
							КонецЕсли;
						Иначе
							// Выполняем поиск далее.
						КонецЕсли;
					КонецЦикла;	
				Иначе
					РезультатФункции = Новый Массив;        // Нет реквизита на форме.
				КонецЕсли;
			Иначе
				РезультатФункции = Новый Массив;			// Пустой реквизит организации.
			КонецЕсли;
		Иначе
			РезультатФункции = Новый Массив;				// Нет справочника БД.
		КонецЕсли;
	Исключение
		ТекстСообщения = НСтр("ru = 'При получении реквизита организации для объекта возникли ошибки: %ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки());
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
		РезультатФункции = Новый Массив;					// Возникла ошибка.
	КонецПопытки;
	Возврат РезультатФункции;		
КонецФункции		// ПолучитьМассивИменРеквизитаОрганизацииСогласования()

// Устанавливает в таблицу обработчиков события организации при изменении на форме Форма
// текущий обработчик элемента ЭлементОрганизацияВход.
Процедура ЗаписатьПредыдущийОбработчикИзмененияОрганизации(Форма, ЭлементОрганизацияВход) Экспорт
	// Получаем предыдущий обработчик.
	ПредыдущийОбработчик = ЭлементОрганизацияВход.ПолучитьДействие("ПриИзменении");
	Если СокрЛП(ПредыдущийОбработчик) <> "" Тогда
		// Поиск обработчика в таблице.
		ИмяЭлемента = ЭлементОрганизацияВход.Имя;
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ИмяРеквизита", ИмяЭлемента);
		НайденныеСтроки = Форма.ОбработчикиИзмененияОрганизации.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда
			// Запись найдена. Запишем обработчик, если она пустая.
			Для Каждого ТекНайденныеСтроки Из НайденныеСтроки Цикл
				Если СокрЛП(ТекНайденныеСтроки.ИмяОбработчика) = "" Тогда
					ТекНайденныеСтроки.ИмяОбработчика = ПредыдущийОбработчик;	
				Иначе
					// Оставляем предыдущий вариант.
				КонецЕсли;
			КонецЦикла;	
		Иначе
			// Запись не найдена. Создадим новую.
			НоваяСтрока = Форма.ОбработчикиИзмененияОрганизации.Добавить();
			НоваяСтрока.ИмяРеквизита	 = ИмяЭлемента;
			НоваяСтрока.ИмяОбработчика	 = ПредыдущийОбработчик;
		КонецЕсли;
	Иначе
		// Действие не сопоставлено. Пропускаем.
	КонецЕсли;
КонецПроцедуры		// ЗаписатьПредыдущийОбработчикИзмененияОрганизации()

// Устанавливает новое действие ПриИзменении для реквизитов организации на этой форме.
Функция УстановитьДействиеПриИзмененииСогласованияОрганизации(Форма) Экспорт
	РезультатФункции = ДействияСогласованиеУХСервер.ПолучитьМассивИменРеквизитаОрганизацииСогласования(Форма);
	Форма["ОбработчикиИзмененияОрганизации"].Очистить();
	Для Каждого ТекРезультатФункции Из РезультатФункции Цикл
		ЭлементОрганизация = Форма.Элементы[ТекРезультатФункции];
		ДействияСогласованиеУХСервер.ЗаписатьПредыдущийОбработчикИзмененияОрганизации(Форма, ЭлементОрганизация);
		ЭлементОрганизация.УстановитьДействие("ПриИзменении", "ПриИзмененииЭлементаОрганизации_Подключаемый"); 
	КонецЦикла;	
	Возврат РезультатФункции;	
КонецФункции		// УстановитьДействиеПриИзмененииСогласованияОрганизации()

// Выводит на форму Форма панель согласования и устанавливает обработчики событий
// для элементов панели.
Процедура НарисоватьПанельСогласованияИОпределитьСостояниеОбъекта(Форма, РодительскаяГруппаВход = неопределено) Экспорт
	ЭлементыФормы = Форма.Элементы;
	ПанельСогласованияРазмещена = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементыФормы, "ГруппаСтатусыСогласования");
	Если НЕ ПанельСогласованияРазмещена Тогда
		// Вывод панели согласования.
		Если ТипЗнч(РодительскаяГруппаВход) = Тип("ГруппаФормы") тогда
			МодульСогласованияДокументовУХ.НарисоватьПанельСогласования(ЭлементыФормы, РодительскаяГруппаВход);
		Иначе
			МодульСогласованияДокументовУХ.НарисоватьПанельСогласования(ЭлементыФормы, Форма);
		КонецЕсли;
		// Добавление действие кнопкам согласования.
		Форма.Команды["ПринятьКСогласованию"].Действие	 = "ПринятьКСогласованию_Подключаемый";
		Форма.Команды["ИсторияСогласования"].Действие	 = "ИсторияСогласования_Подключаемый";		
		Форма.Команды["СогласоватьДокумент"].Действие	 = "СогласоватьДокумент_Подключаемый";
		Форма.Команды["ОтменитьСогласование"].Действие	 = "ОтменитьСогласование_Подключаемый";
		Форма.Команды["МаршрутСогласования"].Действие	 = "МаршрутСогласования_Подключаемый";
		Форма.Команды["ВложенияСогласования"].Действие	 = "ВложенияСогласования_Подключаемый";
	Иначе
		// Панель уже есть на форме.
	КонецЕсли;
	// Определение состояния и ответственных.
	
	ДействияСогласованиеУХСервер.ОпределитьСостояниеЗаявки(Форма);
		
	// Добавление обработчика списка состояний.
	ЭлементСтатусОбъекта = ЭлементыФормы.Найти("СтатусОбъекта"); // ПолеФормы
	Если ЭлементСтатусОбъекта <> Неопределено Тогда
		Если ЭлементСтатусОбъекта.Вид = ВидПоляФормы.ПолеВвода Тогда
			ЭлементСтатусОбъекта.УстановитьДействие("ОбработкаВыбора", "СтатусОбъектаОбработкаВыбора"); 
		Иначе
			// В прочих случаях не устанавливаем обработчик выбора.
		КонецЕсли;
	Иначе
		// Нет элемента Статус объекта.
	КонецЕсли;
	// Добавление обработчиков элементам-организациям.
	#Если НЕ ВебКлиент Тогда
	
	УстановитьДействиеПриИзмененииСогласованияОрганизации(Форма);
	
	#КонецЕсли
КонецПроцедуры		// НарисоватьПанельСогласованияИОпределитьСостояниеОбъекта()

// Выставляет объекту формы и его подчиненным объектам Форма новый статус СтатусВход. 
Функция ИзменитьСостояниеЗаявкиСервер(ОбъектСогласования, СтатусВход) Экспорт
		
	НачатьТранзакцию();
	
	Результат = УправлениеПроцессамиСогласованияУХ.ПеревестиЗаявкуВПроизвольноеСостояние(ОбъектСогласования, СтатусВход);
	
	Если Не Результат тогда		
		ОтменитьТранзакцию();
		Возврат ложь;
	КонецЕсли;
	
	Если Результат Тогда
		Результат = УправлениеПроцессамиСогласованияУХ.УстановитьСтатусыПодчиненныхОбъектов(ОбъектСогласования,, СтатусВход);
	КонецЕсли;
		
	Если Результат тогда
		ЗафиксироватьТранзакцию();
		Возврат Истина;
	Иначе		
		ОтменитьТранзакцию();
		Возврат ложь;
	КонецЕсли;
		
КонецФункции		// ИзменитьСостояниеЗаявкиКлиент()

// Проверяет, является ли объект согласования заявкой на операцию.
//
// Параметры:
//   ТипОбъектаСогласования - <Тип> - тип объекта согласования
//
// Возвращаемое значение:
//   Булево - Истина, если объект согласования является заявкой на операцию, иначе Ложь
Функция ЭтоЗаявкаНаОперацию(ТипОбъектаСогласования) Экспорт
	
	ЭтоЗаявкаНаОперацию = Ложь;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПодсистемыУХ.КорпоративноеКазначейство") Тогда
		
		МодульЗаявкиНаОперации = ОбщегоНазначения.ОбщийМодуль("ЗаявкиНаОперацииКлиентСервер");
		ЭтоЗаявкаНаОперацию = МодульЗаявкиНаОперации.ЭтоЗаявкаНаОперацию(ТипОбъектаСогласования);
		
	КонецЕсли;
	
	Возврат ЭтоЗаявкаНаОперацию;
	
КонецФункции
